# Objects Joining

## Concat()

In [1]:
import pandas as pd
data=[[15, "Francja", 4.1, "Becky"],
      [44, "Kanada", 6.1, "Leanne"]]
more_users = pd.DataFrame(data = data, columns = ["wiek", "kraj", "ocena", "imię"], index = [1000,1011])
df = pd.read_excel("D:\Repozytorium\Kody_Python\Python_ksiazka_przyklady\excel\course_participants.xlsx", index_col=0)
more_users

      wiek     kraj  ocena    imię
1000    15  Francja    4.1   Becky
1011    44   Kanada    6.1  Leanne

In [2]:
#Concat is a type of joiner for different data
pd.concat([df,more_users], axis=0)

        imię  wiek     kraj  ocena kontynent
1001    Mark    55   Włochy    4.5    Europa
1000    John    33      USA    6.7   Ameryka
1002     Tim    41      USA    3.9   Ameryka
1003   Jenny    12   Niemcy    9.0    Europa
1000   Becky    15  Francja    4.1       NaN
1011  Leanne    44   Kanada    6.1       NaN

In [3]:
"Creating new data and setting capitalize function for functions name"
data = [[3,4], [5,6]]
more_categories = pd.DataFrame(data = data, columns= ["testy", "logowania"], index = [1000,2000])
more_categories.columns = more_categories.columns.str.capitalize()
more_categories

      Testy  Logowania
1000      3          4
2000      5          6

In [4]:
pd.concat([df, more_categories], axis=1)

       imię  wiek    kraj  ocena kontynent  Testy  Logowania
1001   Mark  55.0  Włochy    4.5    Europa    NaN        NaN
1000   John  33.0     USA    6.7   Ameryka    3.0        4.0
1002    Tim  41.0     USA    3.9   Ameryka    NaN        NaN
1003  Jenny  12.0  Niemcy    9.0    Europa    NaN        NaN
2000    NaN   NaN     NaN    NaN       NaN    5.0        6.0

## Join and merge

#### Join - Inner, left, right, outer

In [5]:
df1 = pd.DataFrame(data = [[1,2], [3,4], [5,6]], columns = ["A", "B"])
df1

   A  B
0  1  2
1  3  4
2  5  6

In [6]:
df2 = pd.DataFrame(data = [[10,20], [30,40]], columns = ["C", "D"], index= [1,3])
df2

    C   D
1  10  20
3  30  40

In [7]:
"By indexes"
df1.join(df2, how="inner")

   A  B   C   D
1  3  4  10  20

In [8]:
"By left side (mandatory)"
df1.join(df2, how="left")

   A  B     C     D
0  1  2   NaN   NaN
1  3  4  10.0  20.0
2  5  6   NaN   NaN

In [9]:
"By right side (mandatory)"
df1.join(df2, how="right")

     A    B   C   D
1  3.0  4.0  10  20
3  NaN  NaN  30  40

In [10]:
"All data"
df1.join(df2, how="outer")

     A    B     C     D
0  1.0  2.0   NaN   NaN
1  3.0  4.0  10.0  20.0
2  5.0  6.0   NaN   NaN
3  NaN  NaN  30.0  40.0

#### Merge()

In [11]:
"Creating column with the same name"
df1["kategoria"] = ["a", "b", "c"]
df2["kategoria"] = ["c", "b"]

In [12]:
df1.merge(df2,how="inner",on=["kategoria"])

   A  B kategoria   C   D
0  3  4         b  30  40
1  5  6         c  10  20

In [13]:
df1.merge(df2,how="left", on=["kategoria"])

   A  B kategoria     C     D
0  1  2         a   NaN   NaN
1  3  4         b  30.0  40.0
2  5  6         c  10.0  20.0